import 'package:amity2/util/Import_Package.dart';

class ThemeController extends GetxController{
  final List<String> theme = [
    '영화','애니','웹툰','인물','물건','음악'
  ];
  final List<String> movie = [
    '타이타닉', '사랑과 영혼', '아이언맨','스파이더맨','캡티아메리카','헐크','인셉션','케리비안의 해적',
        '닥터스트레인지','슈렉','미녀와야수','여고괴담','기생충','알라딘','겨울왕국','아저씨','타짜',
      '범죄도시','오펀:천사의비밀','곤지암','아이스에이지','몬스터주식회사','센과치히로의 행방불명','하울의 움직이는 성',
    '보스베이비','마틸다','너의이름은','살인자의 기억법','인질','기적','내아내의 모든것','승리호','신과함께',
    '괴물','부산행','악마를 보았다','스물','내안의 그놈','청년경찰','럭키','써니','해바라기','숨바꼭질','엽기적인그녀',
    '검사외전','국가대표','7번방의선물','친구','리틀포레스트'
  ];
  final List<String> animation =[
    '짱구는 못말려','도라에몽','명탐정코난','이누야샤','케릭케릭체인지','닌자보이난타로','꾸러기닌자토리','헬싱','스파이패밀리',
        '블랙클로버','전생했더니슬라임이었던건에대하여','진격의거인','죠죠의기묘한모험','일곱개의대죄','싸이코패스','하이큐','암살교실',
    '식극의소마','카케구루이','쿠로코의농구','겁쟁이페달','4월은너의거짓말','아진','도쿄구울','흔해빠진직업으로세계최강','불꽃소방대','페어리테일',
    '종말의세라프','괴물사변','일하는세포','방패용사성공담','귀멸의칼날','포켓몬스터','나의히어로아카데미','신의탑','갑철성의카바네리',
    '어떤과하의초전자포','신중용사','오버로드','디지몬어드벤쳐','소드아트온라인','심슨','소닉','테니스의왕자',
    '아노하나'
  ];
  final List<String> webtoon =[

  ];

  final List<String> celeb = [
      '유재석','비욘세','원빈','마이클잭슨','(레드벨벳)아이린','(레드벨벳)슬기','아이유','태연','엘사','하하','김종국','송지효',
    '하지원','한효주','비','김태희','아이키','스티븐잡스','조니뎁','지드레곤','전소미','제시','조인성','지코','효린',
    '(아이들)전소연','설현','싸이','임영웅','박진영','허니제이','CL','(트와이스)나연','(트와이스)모모','강호동','은지원','이승기','전지현','신동엽',
    '박재범','손흥민','박나래','한혜진','전현무','(마마무)화사','(샤이니)키','박보검','최우식','송강호','(오마이걸)미미','(오마이걸)유아','(아이브)안유진',
        '김희철','(에스파)윈터','(에스파)카리나','풍자','광희','조혜련','(BTS)진','임창정','유희열','이민호','유아인'
  ];

  final List<String> product =[
    '마스카라','자유의여신상','순간접착제','미끄럼틀','그네','향수','자이로드롭','뽕브라','모기향','복사기','셀카봉',
    '롤러코스터','에스컬레이터','엘레베이터','흔들의자','자석','스카이콩콩','치아교정','립스틱','립밤','볼터치','비키니','레쉬가드',
    '텀블러','손거울','노트북','물티슈','꽃다발','커플링','귀걸이','웨딩드레스','하이힐','코인노래방','비트코인','선글라스','미스트',
    '안마의자','손전등','아이폰','썬크림','양산','이쑤시개','효자손','시계','에어컨','키보드','담배','커피포트','가스레인지','냉장고',
    '전자레인지','침대','전기장판','멀티탭','신발장','러그','팬티','청소기','라이터','충전기','보일러','선풍기',
    '부채','도어락','화장지','물티슈','베란다','백팩','핸드백','세탁기','싱크대','종이백','비닐봉지','우산','천막',
    '텐트','달력','노트북','컴퓨터','모니터','볼펜','야구공','축구공','손난로','수건','샤워기','테이프','데오드란트','바벨','요가매트',
    '디퓨저','옷걸이','헹거','슬리퍼','고무장갑','머플러','패딩','코트','면봉','빗','맥주잔','소주잔','스펀지','노트',
    '연필꽂이','머리핀','후라이팬','쓰레기통','비누','샴푸','컨디셔너','폼클렌징','팩','칫솔','헤어드라이기','고데기','카메라',
    '겔러시z플립','신용카드','유희왕카드','포켓몬카드','띠부띠부씰','드럼','피아노','리코너','플룻','심벌즈','실로폰','리코디언',
    '첼로','바이올린','기타','일렉기타','인형','후드티','청바지','벨트'
  ];
  final List<String> music =[
    '(아이들)Nxde','(르세라핌)ANTIFRAGILE','(지코)새삥','(아이브)After Like','(뉴진스)Hype Boy',
    '(크러쉬)Rush Hour','(블랙핑크)Shut Down','(뉴진스)Attention','(블랙핑크)Pink Venom','(아이브)Love Dive',
    '(아이들)TomBoy','(비비)LAW','(뉴진스)Cookie','(싸이)That That','(아이브)Eleven','(소녀시대)Forever1',
    '(BTS)Dynamite','(르세라핌)FEARLESS','(있지)SNEAKERS','(BTS)Butter','(에스파)도깨비불','(나연)POP!',
    '(아이들)MyBag','(BTS)작은것들을위한시','(BTS)Permission to Dance','(에스파)NextLevel','(레드벨벳)Feel My Rhythm',
    '(태연)INVU','(아이유)Celebrity','(주시크)너를생각해','(태연)Weekend','(선미)열이올라요','(에스파)Girls','(트와이스)TalkThatTalk',
    '(엔믹스)DICE','(최예나)SMILEY','(브레이브걸스)롤린','(블랙핑크)Lovesick Girls','(제시) ZOOM',
    '(오마이걸)Dun Dun Dance', '(위너)ReallyReally','(트와이스)Knock Knock','(블랙핑크)마지막처럼',
    '(레드벨벳)빨간맛','(블랙핑크)불장난','(레드벨벳)Rookie','(트와이스)TT','(선미)가시나','(박재범)All I Wanna Do',
    '(트와이스)SIGNAL','(싸이)NewFace','(청하)Why Don\'t You Know', '(마마무)데칼코마니','(싸이)I LUV It',
    '(블락비)Yesterday','(지코)Artist','(레드벨벳)러시안룰렛','(마마무)나로말할것 같으면','(워너원)에너제틱',
    '(국민의아들)NEVER','(트와이스)Cheer Up','(에이핑크)Five','(하이라이트)얼굴찌푸리지 말아요','(언니쓰)맞지?',
    '(엑소)KoKoBop', '(블랙핑크)휘파람','(빅뱅)LastDance','(여자친구)시간을달려서','(BTS)피 땀 눈물',
    '(마마무)넌is뭔들','(씨쓰타)I Like That','(원더걸스)Why So Lonely','(엑소)몬스터','(BTS)불타오르네',
    '(태연)Why','(비스트)리본','(여자친구)너그리고나','(블락비)Toy','(IOI)너무너무너무','(언니쓰)ShutUp',
    '(블랙핑크)붐바야','(IOI)Dream Girls','(EXID)L.I.E','(빅뱅)뱅뱅뱅','(마마무)음오아예','(빅뱅)Loser',
    '(미스에이)다른남자말고너','(BTS)I NEED U','(여자친구)오늘부터우리는','(EXID)아예','(EXID)핫핑크','(EXID)위아래',
    '(AOA)심쿵해','(씨쓰타)Shake It','(씨쓰타)나혼자','(씨쓰타)Touch My Body','(아이유)스물셋','(엑소)Call Me Baby',
    '(레드벨벳)IceCreamCake','(소녀시대)LionHeart','(박진영)어머님이누구니','(포미닛)미쳐','(트와이스)우아하게','(소녀시대)파티',
    '(에이핑크)Remember','(러블리즈)아츄','(여자친구)유리구슬','(박재범)몸매','(레드벨벳)덤덤','(전소미)덤덤','(현아)빨개요',
    '(엑소)LoveMeRight','(청하)롤러코스터','(청하)벌써12시','(2PM)우리집','(2PM)Heart Beat','(브라운아이드걸스)아브라카타브라',
    '(브라운아이드걸스)Sign','(걸스데이)Something','(걸스데이)여자대통령','(걸스데이)기대해','(에이핑크)몰라요','(AOA)짧은치마',
    '(AOA)사뿐사뿐','(2NE1)컴백홈','(엑소-K)중독','(엑소)으르렁','(오렌지카라멜)까탈레나','(블락비)Her','(선미)보름달',
    '(있지)달라달라','(있지)ICY','(제니)SOLO','(리사)LALISA','(트와이스)Yes or Yes','(아이유)삐삐',
    '(송민호)아낙네','(트와이스)FANCY','(화사)멍청이','(화사)마리아','(청하)Snapping','(BTS)IDOL',
    '(위너)MILLIONS','(트와이스)Dance The Night Away','(블랙핑크)뚜두뚜두','(마마무)별이ㅣ빛나는밤','(여자친구)밤',
    '(에이핑크)1도없어','(아이들)라타타','(아이들)덤디덤디','(아이들)한','(레드벨벳)파워 업','(위너)EveryDay',
    '(샤이니)루시퍼','(샤이니)누난너무예뻐','(선미)사이렌','(모모랜드)뿜뿜','(미스에이)Bad girl Good girl',
    '(샤이니)Don\'t call me',
  ];

  GlobalKey themeKey = GlobalKey();

  double getPositionY(){
    var box = themeKey.currentContext!.findRenderObject();
    var translation = box!.getTransformTo(null).getTranslation();
    return box.paintBounds.shift(Offset(translation.x, translation.y)).bottomCenter.dy;
  }
}